PARTS_OF_SPEECH = {
    "NOUN": "Существительное",
    "VERB": "Глагол",
    "ADJ": "Прилагательное",
    "ADV": "Наречие",
    "PRON": "Местоимение",
    "NUM": "Числительное",
    "CONJ": "Союз",
    "PART": "Частица",
    "INTJ": "Междометие",
    "PUNCT": "Знак препинания",
    "ADP": "Предлог",
    "SCONJ": "Подчинительный союз",
    "DET": "Определитель"
}

SYNTACTIC_ROLES = {
    "root": "Корень",
    "nsubj": "Подлежащее",
    "obj": "Дополнение",
    "iobj": "Косвенное дополнение",
    "ccomp": "Придаточное дополнительное",
    "xcomp": "Дополнительный предикатив",
    "advmod": "Обстоятельство",
    "amod": "Определение",
    "det": "Определитель",
    "cc": "Сочинительный союз",
    "case": "Предлог",
    "obl": "Обстоятельственное дополнение",
    "appos": "Приложение",
    "conj": "Сочиненное предложение",
    "nummod:gov": "Грамматическое числительное",
    "punct": "Знак препинания",
    "parataxis": "Парцелляция",
    "acl": "Определительное придаточное",
    "nmod": "Именное дополнение"
}